Overload List
Name  |   Description
IsValidShape(IList GeometryObject )
 Validates shape to be stored in a DirectShape. Supercedes and extends IsValidGeometry().
IsValidShape(IList GeometryObject , DirectShapeTargetViewType)
 Validates view-specific shape to be stored in a DirectShape. Expects a non-default view type.
 See Also
  DirectShape Class
  DirectShape Members
  Autodesk.Revit.DB Namespace